steferic/world-radio/firmware-sanity-tests/Inputs/sdkconfig.defaults
# Inputs sanity test defaults for ESP32-S3.
#
# The test only pokes GPIOs and one ADC channel; PSRAM isn't required. It's
# still enabled opportunistically so this can flash onto an N16R8 dev board
# without menuconfig changes. Swap CONFIG_SPIRAM_MODE_OCT for _QUAD on an
# N8R2, or drop the SPIRAM block entirely on a bare S3.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# ISRs use esp_rom_printf, which is safe from IRAM. Pinning the ISR service
# in IRAM avoids a flash-cache hit if the app ever adds flash writes later.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
